In [37]:
import os
import sqlite3
import dotenv
import streamlit as st
import google.generativeai as genai

dotenv.load_dotenv()

import google.generativeai as genai 

genai.configure(api_key=os.getenv("GOOGLE_GEMINI_API_KEY"))

In [38]:
def getQuery(prompt,question):
    model = genai.GenerativeModel("gemini-pro")
    response = model.generate_content([prompt[0],question])
    
    return response.text

In [39]:
# prompt = "Give me simple plain text table creation sql queries which is directly used for sql execution , ignore backticks(```) ans sql keyword in output"

In [40]:
prompt = [
'''
**Prompt:**
Develop a Python script that generates SQL queries for creating and populating a database table named `G_SAILORS`. The script should take user-provided column definitions in the format: `COLUMN1, COLUMN2, COLUMN3, ...` and output corresponding SQL commands.

**Example Input:**
G_SAILORS(SID, SNAME, RATING, AGE)

**Expected Output:**
```sql
CREATE TABLE G_SAILORS (
    sid INT PRIMARY KEY,
    sname VARCHAR(20) NOT NULL,
    rating VARCHAR(10) NOT NULL,
    age INT NOT NULL
);

INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (22, 'Dustin Howell', 'SA', 25);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (85, 'Hannah Howard', 'SA', 22);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (31, 'Dylan Shaw', 'SA', 20);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (58, 'Sophia Douglas', 'SA', 28);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (37, 'Emma Watson', 'SA', 25);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (89, 'Jackson Reed', 'SA', 30);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (62, 'Samuel Walsh', 'SA', 19);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (28, 'Abigail Bennett', 'SA', 22);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (79, 'Harper Martinez', 'SA', 22);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (7, 'Alexander Moore', 'SA', 24);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (49, 'Ava Johnson', 'SA', 21);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (97, 'Isabella Garcia', 'SA', 23);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (72, 'Liam Brown', 'SA', 18);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (20, 'Elijah Martinez', 'SA', 25);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (60, 'Amelia Rodriguez', 'SA', 23);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (11, 'Sophia Martinez', 'SA', 32);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (53, 'Gabriella Davis', 'SA', 28);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (71, 'Benjamin Miller', 'SA', 31);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (65, 'Audrey Moore', 'SA', 24);
INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (42, 'William Jones', 'SA', 27);
```

**Instructions:**
The output should only contain the generated SQL queries, without any triple backticks (` ``` `) at the beginning and end, and it should not include the word "SQL" in the output. The queries should be formatted correctly for creating and populating the specified table.'''
]

In [41]:
question = "SAILORS (sid, sname, rating, age)"

In [44]:
print(getQuery(prompt[0],question))

```
CREATE TABLE SAILORS (
    sid INT PRIMARY KEY,
    sname VARCHAR(25) NOT NULL,
    rating VARCHAR(15) NOT NULL,
    age INT NOT NULL
);
```

The `SAILORS` table stores information about sailors, including their unique sailor ID (`sid`), name (`sname`), rating (`rating`), and age (`age`).

Here's an example of how to insert data into the `SAILORS` table:

```
INSERT INTO SAILORS (sid, sname, rating, age) VALUES
(22, 'Dustin Hoffman', 'Captain', 45),
(88, 'Martin Sheen', 'Commander', 50),
(31, 'Jack Nicholson', 'Lieutenant', 32),
(55, 'Al Pacino', 'Lieutenant Commander', 37),
(32, 'Diane Keaton', 'Ensign', 25),
(19, 'Marlon Brando', 'Admiral', 60);
```

This will create six records in the `SAILORS` table.

You can then query the `SAILORS` table to retrieve data about sailors. For example, the following query retrieves the names of all sailors who are 32 years old:

```
SELECT sname
FROM SAILORS
WHERE age = 32;
```

This query will return the following result:

```
Diane Keaton
```

In [17]:
def createTable(queries):
    conn = sqlite3.connect('students.db')
    cur = conn.cursor()

    print(queries)
    cur.execute(queries)
    
    conn.commit()
    conn.close()

In [31]:
def askquestion():
    st.set_page_config(page_title="sql -> Database table")
    st.header("sql -> Database table")

    queries = st.text_input("Write SQL for tables and insert values: ", key="input")
    submit = st.button("Create the tables")

    if submit:
        createTable(queries)

In [35]:
import sqlite3

def execute_sql_queries():
    # Connect to an in-memory SQLite database
    conn = sqlite3.connect('chatgpt.db')
    cursor = conn.cursor()

    # Execute the SQL queries
    sql_queries = """
    CREATE TABLE G_SAILORS (
        sid INT PRIMARY KEY,
        sname VARCHAR(20) NOT NULL,
        rating VARCHAR(10) NOT NULL,
        age INT NOT NULL
    );
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (22, 'Dustin Howell', 'SA', 25);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (85, 'Hannah Howard', 'SA', 22);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (31, 'Dylan Shaw', 'SA', 20);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (58, 'Sophia Douglas', 'SA', 28);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (37, 'Emma Watson', 'SA', 25);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (89, 'Jackson Reed', 'SA', 30);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (62, 'Samuel Walsh', 'SA', 19);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (28, 'Abigail Bennett', 'SA', 22);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (79, 'Harper Martinez', 'SA', 22);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (7, 'Alexander Moore', 'SA', 24);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (49, 'Ava Johnson', 'SA', 21);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (97, 'Isabella Garcia', 'SA', 23);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (72, 'Liam Brown', 'SA', 18);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (20, 'Elijah Martinez', 'SA', 25);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (60, 'Amelia Rodriguez', 'SA', 23);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (11, 'Sophia Martinez', 'SA', 32);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (53, 'Gabriella Davis', 'SA', 28);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (71, 'Benjamin Miller', 'SA', 31);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (65, 'Audrey Moore', 'SA', 24);
    INSERT INTO G_SAILORS (sid, sname, rating, age) VALUES (42, 'William Jones', 'SA', 27);
    """
    cursor.executescript(sql_queries)

    # Commit and close the connection
    conn.commit()
    conn.close()

# Call the function to execute SQL queries
execute_sql_queries()